Revit 2024 API
BuiltInFailures.StairRampFailures.StairsOnlySingleBoundaryHasRiserWithBothEndsOnBoundaryFailure Property
 Only single boundary case may have riser with its both ends on boundary.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StairsOnlySingleBoundaryHasRiserWithBothEndsOnBoundaryFailure { get; }
Visual Basic
Public Shared ReadOnly Property StairsOnlySingleBoundaryHasRiserWithBothEndsOnBoundaryFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StairsOnlySingleBoundaryHasRiserWithBothEndsOnBoundaryFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace